import { LanguageText } from "./all_text";

export const RU_TEXT: LanguageText = {
  value: "russian",
  t: {
    WORD: {
      CREATE: "Добавить",
      SHOW_FULL: "Показать все",
      EMPTY1: "Здесь пока пусто,",
      EMPTY2: "добавь новые слова 🤪",
    },
    PLAY: {
      H1_P1: "Давай",
      H1_P2: "учиться!",
      MAX: "сколько слов хочешь повторить (максимум 50)",
      GO: "Поехали!",
    },
    ONBOARD: {
      THIS_H1: "Выбери основной язык:",
      THIS_P1: `Выбери язык, на котором ты говоришь свободно. Все интерфейсы
      приложения и описания слов будут на этом языке. Менять
      язык можно будет только раз в 30 дней.`,
      THIS_B1: "Сохранить",
      ANOTHER_H1: "Выбери языки для изучения:",
      ANOTHER_P1:
        "Отметь только те языки, которые действительно хочешь изучать.",
      ANOTHER_P2: "Ты пока ничего не выбрал.",
      ANOTHER_P3: "Ты выбрал: ",
      ANOTHER_B1: "Сохранить",
    },
    ASK: {
      B1: "Сгенерировать",
      B2: "Перейти к слову",
      SELF: "Напишу сам",
      YOUR_LANG: "Напиши на ",
      INPUT_P: "Напиши коротко и ясно ;)",
      G_M: "Как получить лучший результат?",
      G1: "- Напиши слово на языке: ",
      G2: "- Не изменяй грамматику слова",
      G3: "- Пиши только слово или короткую фразу",
    },
    LOGIN: {
      WELCOME: "Добро пожаловать!",
      NEXT: "Пожалуйста, войди через Google, чтобы продолжить 👀",
      GOOGLE: "Войти с помощью Google",
    },
    CREATE: {
      P_EN: `Объясни, что означает слово "[[]]" на английском.
      Ответ нужен на русском. Сначала дай общее объяснение слова.
      Затем составь 3 предложения на английском и переведи их на русский. Объясни
      значение слова в каждом предложении. Напиши коротко и ясно,
      без лишней информации. Ответ нужен без Markdown-разметки.`,
      P_DE: `Объясни, что означает слово "[[]]" на немецком.
      Ответ нужен на русском. Сначала дай общее объяснение слова.
      Затем составь 3 предложения на немецком и переведи их на русский. Объясни
      значение слова в каждом предложении. Напиши коротко и ясно,
      без лишней информации. Ответ нужен без Markdown-разметки.`,
      TITLE: "Твое слово:",
      TITLE_P: "Напиши коротко и ясно ;)",
      DESC: "Что это значит:",
      DESC_P: "Напиши описание для своего слова:",
      SELF: "Хочу сам",
      GEN: "Сгенерировать",
      GEN1: "1. Скопируй текст:",
      GEN2_P1: "2. Перейди на сайт ",
      GEN2_P2: " и вставь текст",
      GEN3: "3. Скопируй результат и вставь его в поле описания",
      SAVE: "Сохранить",
    },
    EDIT: {
      TITLE: "Твое слово:",
      TITLE_P: "Напиши коротко и ясно ;)",
      DESC: "Что это значит:",
      DESC_P: "Напиши описание для своего слова:",
      DELETE: "Удалить",
      SAVE: "Сохранить",
    },
    GOPLAY: {
      END: "Закончить",
      NEXT: "Дальше",
      BACK: "Назад",
    },
    HEADER: {
      WORDS: "Слова",
      PLAY: "Игра",
      PROFILE: "Профиль",
      HI: "Привет, ",
      NEW: "Новое слово",
      CHOOSE: "Выбери язык",
    },
    PROFILE: {
      TLANGS: "Ты изучаешь эти языки:",
      OSLANG: "Язык интерфейса:",
      LOGOUT: "Выйти",
    },
  },
};
